In [1]:
import pandas as pd

In [2]:
import seaborn as sns

In [3]:
df=sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
df['tip'].head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [6]:
df[['tip']].head()

    tip
0  1.01
1  1.66
2  3.50
3  3.31
4  3.61

In [8]:
df[['tip', 'sex']].head()

    tip     sex
0  1.01  Female
1  1.66    Male
2  3.50    Male
3  3.31    Male
4  3.61  Female

In [9]:
df[2:4]

   total_bill   tip   sex smoker  day    time  size
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2

# .loc

In [10]:
df.loc[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [11]:
df.loc[[3]]

   total_bill   tip   sex smoker  day    time  size
3       23.68  3.31  Male     No  Sun  Dinner     2

In [12]:
df.loc[[3, 7]]

   total_bill   tip   sex smoker  day    time  size
3       23.68  3.31  Male     No  Sun  Dinner     2
7       26.88  3.12  Male     No  Sun  Dinner     4

In [13]:
df.loc[3:5]

   total_bill   tip     sex smoker  day    time  size
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

In [17]:
df.loc[:, 'tip'].head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [18]:
df.loc[:, ['tip']].head()

    tip
0  1.01
1  1.66
2  3.50
3  3.31
4  3.61

In [19]:
df.loc[:, ['tip', 'smoker']].head()

    tip smoker
0  1.01     No
1  1.66     No
2  3.50     No
3  3.31     No
4  3.61     No

In [20]:
df2 = df.set_index('sex', inplace=False)
df2.head()

        total_bill   tip smoker  day    time  size
sex
Female       16.99  1.01     No  Sun  Dinner     2
Male         10.34  1.66     No  Sun  Dinner     3
Male         21.01  3.50     No  Sun  Dinner     3
Male         23.68  3.31     No  Sun  Dinner     2
Female       24.59  3.61     No  Sun  Dinner     4

In [24]:
df2.loc['Female'].head()

        total_bill   tip smoker  day    time  size
sex
Female       16.99  1.01     No  Sun  Dinner     2
Female       24.59  3.61     No  Sun  Dinner     4
Female       35.26  5.00     No  Sun  Dinner     4
Female       14.83  3.02     No  Sun  Dinner     2
Female       10.33  1.67     No  Sun  Dinner     3

In [25]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [26]:
df.loc[3, 'time']

'Dinner'

In [27]:
df.loc[3, ['time', 'size']]

time    Dinner
size         2
Name: 3, dtype: object

In [28]:
df.loc[3:5, ['time', 'size']]

     time  size
3  Dinner     2
4  Dinner     4
5  Dinner     4

In [29]:
df.loc[[3], ['time', 'size']]

     time  size
3  Dinner     2

# .iloc

In [31]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [32]:
df.iloc[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

In [33]:
df.iloc[[3]]

   total_bill   tip   sex smoker  day    time  size
3       23.68  3.31  Male     No  Sun  Dinner     2

In [34]:
df.iloc[1:3]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3

In [36]:
df.iloc[:, 4].head()

0    Sun
1    Sun
2    Sun
3    Sun
4    Sun
Name: day, dtype: category
Categories (4, object): [Thur, Fri, Sat, Sun]

In [37]:
df.iloc[:, [4]].head()

   day
0  Sun
1  Sun
2  Sun
3  Sun
4  Sun

In [38]:
df.iloc[1:3, [4]].head()

   day
1  Sun
2  Sun

In [39]:
df.iloc[1:3, [4, 0]].head()

   day  total_bill
1  Sun       10.34
2  Sun       21.01

In [40]:
df2.head()

        total_bill   tip smoker  day    time  size
sex
Female       16.99  1.01     No  Sun  Dinner     2
Male         10.34  1.66     No  Sun  Dinner     3
Male         21.01  3.50     No  Sun  Dinner     3
Male         23.68  3.31     No  Sun  Dinner     2
Female       24.59  3.61     No  Sun  Dinner     4

In [42]:
df2.iloc[1:3]

      total_bill   tip smoker  day    time  size
sex
Male       10.34  1.66     No  Sun  Dinner     3
Male       21.01  3.50     No  Sun  Dinner     3